__old_code/artillery.yml
config:
    target: "http://13.77.149.55:4000"
    phases:
      - duration: 30
        arrivalRate: 30
        rampTo: 300
    processor: "./test/index.js"
scenarios:
- name: "GraphQL Query load test"
  flow:
    - function: "testCases"
    - loop:
        - post:
            url: "/"
            json:
              query: "{{ $loopElement.query }}"
        - log: "----------------------------------"
        - log: "Sent a request to the Query: {{ $loopElement.name }}"
      over: cases